// Задача 65: Задайте значения M и N.
// Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5 -> "1, 2, 3, 4, 5" M = 4; N = 8 -> "4, 5, 6, 7, 8"

void Rec(int N, int M)
{
    if (M > N)
    {
        return;
    }
    Console.Write(M + " ");
    Rec(N, M + 1);
}

Rec(8, 4);